app/Http/Controllers/Api/V2/BannerController.php

select `id`, `position_id`, `name`, `photo`, `url` from `slides` where `status` = 1 and `position_id` = 1 order by RAND()
---
    public function list(Request $request){
        // Lists
		$banner = Slide::where('status', 1)
            ->where('position_id', 1)
            ->inRandomOrder()
            ->select('id', 'position_id', 'name', 'photo', 'url')
            ->get();