app/Http/Controllers/Api/V2/MiscellaneousController.php

select * from `categories`
---
    public function categoryList()
    {
        $query = Category::with('child')->get();

select * from `footers` where `position_id` = 1
select * from `pages` where `pages`.`footer_id` in (1, 2, 3, 4)
---
    public function footerList()
    {
        $footer = Footer::where('position_id', 1)->with('page')->get();