app/Http/Controllers/Api/V2/ProductController.php

select * from `options` where `options`.`id` in (13, 33)
---
    public function flashSale(Request $request){
        $options = Option::find([13, 33]);

select * from `options` where `options`.`id` = 34 limit 1
select count(*) as aggregate from `products` where `status` = 1 and `stock` > 0 and `preorder` = 1 and `preorder_expired` > '2019-11-14 09:38:23'
---
    public function groupBuyPromo(Request $request){
        $limit = ($request->limit) ? $request->limit : 12;
        $imageSale = Option::find(34);

        $productPreorder = Product::where('status', 1)
            ->where('stock', '>', 0)
            ->where('preorder', 1)
            ->where('preorder_expired', '>', date('Y-m-d H:i:s'))
            ->inRandomOrder()
            ->with([
                'category',
                'productphoto' => function ($qy) {
                    $qy->inRandomOrder();
                },
                'user' => function ($qy) {
                    $qy->with(['kabupaten', 'merchant' => function($qm){
                        $qm->with(['address' => function ($qa){
                            $qa->with('kabupaten');
                        }]);
                    }]);
                }
            ])
            ->paginate($limit);

select * from `categories` where `highlight` = 1 order by RAND()
---
    public function categoryHighlight(Request $request){
        $limit = ($request->limit) ? $request->limit : 12;

        $categoryHighlight = Category::where('highlight', 1)
            ->inRandomOrder()
            ->get();

select * from `seasons` where `expired` > '2019-11-14 09:37:18' order by `expired` asc
---
    public function seasonalPromo(Request $request){
        $limit = ($request->limit) ? $request->limit : 12;

        $seasons = Season::where('expired', '>', date('Y-m-d H:i:s'))
            ->orderBy('expired', 'ASC')
            ->with('random_products')
            ->get();

select * from `products` where `status` = 1 and `discount` is not null and 0 = 1 and `stock` > 0 and `sold` >= 0 and `sale` = 0 and `preorder` = 0 or `rating` > 2 order by RAND() limit 30
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 6, 9, 10)
select * from `merchants` where `merchants`.`id` in (14, 114, 156, 160, 163, 169)
select * from `product_photos` where `product_photos`.`product_id` in (371, 390, 398, 531, 533, 542, 552, 587, 705, 721, 723, 742, 963, 4201, 4331, 4686, 5163, 6750, 6849, 6931, 7147, 7606, 7615, 7641, 7649, 7716, 9615, 9621, 9785, 10460) order by RAND()
select * from `users` where `users`.`id` in (99, 1289, 1987, 4793, 4850, 4877)
---
    public function recommendProduct(Request $request){
        $limit = ($request->limit) ? $request->limit : 30;
        $token = $request->bearerToken();
        $category = [];
        // Checking if token exist
        if ($token) {
            $decoded = AuthAccessToken::jwtDecode($token);
            if (!empty($decoded->jti)) {
                $user_id = decrypt($decoded->jti);

                $getTransaction = Transaction::where('user_id', $user_id)
                    ->whereNotNull('payment_id')
                    ->whereNotNull('address_id')
                    ->with(['product' => function ($q) {
                        $q
                        ->with('product');
                    }])
                    ->get();
                // push category
                foreach ($getTransaction as $key => $trans) {
                    foreach ($trans->product as $key => $value) {
                        $cat = $value->product->category_id;
                        if(!in_array($cat, $category, true)){
                            array_push($category, $cat);
                        }
                    }
                }
            }
        }

        $productRecommend = Product::where('status', 1)
            ->whereNotNull('discount')
            ->whereIn('category_id', $category)
            ->where('stock', '>', 0)
            ->where('sold', '>=', 0)
            ->where('sale', 0)
            ->where('preorder', 0)
            ->orWhere('rating', '>', 2)
            ->with([
                'category',
                'productphoto' => function ($qy) {
                    $qy->inRandomOrder();
                },
                'user' => function ($qy) {
                    $qy->with(['kabupaten', 'merchant' => function($qm){
                        $qm->with(['address' => function ($qa){
                            $qa->with('kabupaten');
                        }]);
                    }]);
                }
            ])
            ->inRandomOrder()
            ->take($limit)
            ->get();